xlyric/pv-router-esp8266/src/main.cpp
#include "Arduino.h"
///////////////////
//  Pv router by Cyril Poissonnier 2022 
//  Pv routeur pour détecter l'injection par mesure de volume et envoie d'information sur domoticz 
//  pour réponse ( switch, dimmer ... ) 
//  fait pour fonctionner avec le circuit imprimé v1.1 à 1.4
/////////////////////////

///////////////////
// ----- configuration  
// la prise de valeur est de 72 échantillons par cycles
//  ----- envoie vers serveur domotique
//  la programmation par défaut n'envoie pas vers domoticz  ou jeedom, il faut l'activer sur l'interface et sauvegarder la configuration
//  pour le mode autonome, il est possible de spécifier directement l'ip du dimmer numérique distant ( dans le fichier de conf ). la communication doit aussi être active pour fonctionner.
//
//
// ----- sauvegarde de la configuration --- 
//  faire un /get?save pour sauver la configuration dans le fichier
//  sauvegarde du fichier de config : /Config.json
//  
//  /cosphi permet d'avoir des logs sur le calcul du middle et de la valeur retourné :
// valeurs lu  -- calcul du phi conseillé - calcul des sommes et de différent type de calcul de moyennes
// 
//
//  Ajout de la fonction 
// /get?reset pour redémarrer le pv routeur
//  
/////////////////////////
/**************
 *  numeric Dimmer  Information 
 *  **************
 *  
 *  ---------------------- OUTPUT & INPUT Pin table ---------------------
 *  +---------------+-------------------------+-------------------------+
 *  |   Board       | INPUT Pin               | OUTPUT Pin              |
 *  |               | Zero-Cross              |                         |
 *  +---------------+-------------------------+-------------------------+
 *  | ESP8266       | D1(IO5),    D2(IO4),    | D0(IO16),   D1(IO5),    |
 *  |               | D5(IO14),   D6(IO12),   | D2(IO4),    D5(IO14),   |
 *  |               | D7(IO13),   D8(IO15),   | D6(IO12),   D7(IO13),   |
 *  |               |                         | D8(IO15)                |
 *  +---------------+-------------------------+-------------------------+
 */


//***********************************
//************* Déclaration des libraries
//***********************************

// time librairy 
#include <NTPClient.h>
// Dimmer librairy 
#include <RBDdimmer.h>   /// the corrected librairy  in RBDDimmer-master-corrected.rar , the original has a bug
// Web services
#include <ESP8266WiFi.h>
#include <ESPAsyncWiFiManager.h>     // https://github.com/alanswx/ESPAsyncWiFiManager
#include <ESPAsyncTCP.h>  /// https://github.com/me-no-dev/ESPAsyncTCP
#include <ESPAsyncWebServer.h> /// https://github.com/me-no-dev/ESPAsyncWebServer 
#include <ESP8266HTTPClient.h> 
// File System
#include <LittleFS.h>
#include <Wire.h>  // Only needed for Arduino 1.6.5 and earlier
#include <ArduinoJson.h> // ArduinoJson : https://github.com/bblanchon/ArduinoJson
// Oled
#include "SSD1306Wire.h" /// Oled ( https://github.com/ThingPulse/esp8266-oled-ssd1306 ) 
// ota mise à jour sans fil
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
//mqtt
#include <PubSubClient.h>
#define mqtt_user "pvrouter"
// Dallas 18b20
//#include <OneWire.h>
//#include <DallasTemperature.h>

// Include custom images
#include "images.h"

const String VERSION = "Version 2.10.0" ;
String logs;

//****  déclaration des fonctions ****// 

void reconnect();
void mqtt(String idx, String value);
void dimmer(int commande);
boolean SendToDomotic(String Svalue);
void rt_loop (unsigned long startmicro, unsigned long timer );
void valeur_moyenne();
int mesure_resistance ();
void oscilloscope();
void affiche_transmission(int actif);
void affiche_heure(); 
void affiche_info_delat() ;
void affiche_info_injection(int injection_mode ); 
void affiche_info_volume(int volume ) ;
void affiche_info_transmission (int transmission ); 
void affiche_info_main(); 
void front(int variation); 

////BETA
//  int freqmesure = 85; 
  int freqmesure = 72; 
  int readtime = ( 1000000/(50*freqmesure)); 
  int goodcycle = freqmesure - 5;
  String rawdata = "";

//***********************************
//************* Gestion de la configuration
//***********************************

struct Config {
  //char hostname[15];
  //int port;
  //char apiKey[64];
  //bool UseDomoticz;
  //bool UseJeedom;
  int IDX;
  //char otapassword[64];
  int delta;
  int deltaneg;
  int cosphi;
  int readtime;
  int cycle;
  bool sending;
  bool autonome;
  char dimmer[15];
  bool dimmerlocal;
  float facteur;
  int num_fuse;
  bool mqtt;
  char mqttserver[15];
  int IDXdimmer;
  int tmax;
  int resistance;
  char Publish[100];
};

const char *filename_conf = "/config.json";
Config config; 

//***********************************
//************* Gestion de la configuration - Lecture du fichier de configuration
//***********************************

// Loads the configuration from a file
void loadConfiguration(const char *filename, Config &config) {
  // Open file for reading
  File configFile = LittleFS.open(filename_conf, "r");

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use arduinojson.org/v6/assistant to compute the capacity.
  StaticJsonDocument<1024> doc;

  // Deserialize the JSON document
  DeserializationError error = deserializeJson(doc, configFile);
  if (error) {
    Serial.println(F("Failed to read file, using default configuration in function loadConfiguration"));
    logs += "Failed to read file, using default configuration in function loadConfiguration/r/n";

  }

  
  // Copy values from the JsonDocument to the Config
  //config.port = doc["port"] | 8080;
  /*strlcpy(config.hostname,                  // <- destination
          doc["hostname"] | "192.168.1.20", // <- source
          sizeof(config.hostname));         // <- destination's capacity
  */
  /*strlcpy(config.apiKey,                  // <- destination
          doc["apiKey"] | "Myapikeystring", // <- source
          sizeof(config.apiKey));         // <- destination's capacity
		  
  config.UseDomoticz = doc["UseDomoticz"] | false; 
  config.UseJeedom = doc["UseJeedom"] | false; */
  config.IDX = doc["IDX"] | 62; 
  config.IDXdimmer = doc["IDXdimmer"] | 60; 
  
  /*strlcpy(config.otapassword,                  // <- destination
          doc["otapassword"] | "Pvrouteur2", // <- source
          sizeof(config.otapassword));         // <- destination's capacity
  */
  config.facteur = doc["facteur"] | 0.86; 
  config.delta = doc["delta"] | 50; 
  config.num_fuse = doc["fuse"] | 70;
  config.deltaneg = doc["deltaneg"] | -100; 
  config.cosphi = doc["cosphi"] | 23; 
  config.readtime = doc["readtime"] | 555;
  config.cycle = doc["cycle"] | 25;
  config.tmax = doc["tmax"] | 65;
  config.resistance = doc["resistance"] | 1000;
  config.sending = doc["sending"] | false;
  config.autonome = doc["autonome"] | true;
  config.mqtt = doc["mqtt"] | false;
  config.dimmerlocal = doc["dimmerlocal"] | false;
  strlcpy(config.dimmer,                  // <- destination
          doc["dimmer"] | "192.168.1.20", // <- source
          sizeof(config.dimmer));         // <- destination's capacity
  strlcpy(config.mqttserver,                  // <- destination
          doc["mqttserver"] | "192.168.1.20", // <- source
          sizeof(config.mqttserver));         // <- destination's capacity
  strlcpy(config.Publish,                  // <- destination
          doc["Publish"] | "domoticz/in", // <- source
          sizeof(config.Publish));         // <- destination's capacity
  configFile.close();
      
