xlyric/pv-router-esp8266/src/main.cpp
}

//***********************************
//************* Gestion de la configuration - sauvegarde du fichier de configuration
//***********************************

void saveConfiguration(const char *filename, const Config &config) {
  
  // Open file for writing
   File configFile = LittleFS.open(filename_conf, "w");
  if (!configFile) {
    Serial.println(F("Failed to open config file for writing in function Save configuration"));
    logs += "Failed to open config file for writing in function Save configuration/r/n";
    return;
  }

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<512> doc;

  // Set the values in the document
  /*doc["hostname"] = config.hostname;
  doc["port"] = config.port;
  doc["apiKey"] = config.apiKey;
  doc["UseDomoticz"] = config.UseDomoticz;
  doc["UseJeedom"] = config.UseJeedom;*/
  doc["IDX"] = config.IDX;
  doc["IDXdimmer"] = config.IDXdimmer;
  //doc["otapassword"] = config.otapassword;
  doc["delta"] = config.delta;
  doc["deltaneg"] = config.deltaneg;
  doc["cosphi"] = config.cosphi;
  doc["readtime"] = config.readtime;
  doc["cycle"] = config.cycle;
  doc["sending"] = config.sending;
  doc["autonome"] = config.autonome;
  doc["dimmer"] = config.dimmer;
  doc["dimmerlocal"] = config.dimmerlocal;
  doc["facteur"] = config.facteur;
  doc["fuse"] = config.num_fuse;
  doc["mqtt"] = config.mqtt;
  doc["mqttserver"] = config.mqttserver;  
  doc["tmax"] = config.tmax;
  doc["resistance"] = config.resistance;
  doc["Publish"] = config.Publish;

  // Serialize JSON to file
  if (serializeJson(doc, configFile) == 0) {
    Serial.println(F("Failed to write to file in function Save configuration "));
    logs += "Failed to write to file in function Save configuration:r/n";
  }

  // Close the file
  configFile.close();
}

//***********************************
//************* dimmer
//***********************************

#define outputPin  D7 
#define zerocross  D6 // for boards with CHANGEBLE input pins
dimmerLamp dimmer_hard(outputPin, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
int dimmer_security = 60;  // coupe le dimmer toute les X minutes en cas de probleme externe. 
int dimmer_security_count = 0; 


//***********************************
//************* Dallas 18b20
//***********************************
#define ONE_WIRE_BUS 7
#define TEMPERATURE_PRECISION 10

//***********************************
//************* Time 
//***********************************
const long utcOffsetInSeconds = 3600;
char daysOfTheWeek[7][12] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "europe.pool.ntp.org", utcOffsetInSeconds);
int timesync = 0; 
int timesync_refresh = 120; 

void call_time() {
  if ( timesync_refresh >= timesync ) {  timeClient.update(); timesync = 0; }
  else {timesync++;} 
} 
 
String getTime() {
  String state; 
  state = timeClient.getHours() + ":" + timeClient.getMinutes() ; 
  return String(state);
}

//***********************************
//************* Afficheur Oled
//***********************************
const int I2C_DISPLAY_ADDRESS = 0x3c;
SSD1306Wire  display(0x3c, D1, D2);

//***********************************
//************* Constantes
//***********************************
//constantes de mesure

#define OLED 1  // activation de l'afficheur oled
#define attente 2 /// nombre de 1/2 secondes entre chaque cycle de mesure.

int middle ;


//constantes de fonctionnement
#define USE_SERIAL  Serial
#define linky  A0
#define lcd_scd D1  // LCD et OLED
#define lcd_scl D2  // LCD et OLED 
#define sens D5   /// niveau de la diode 
int dimmer_power = 0;
int security=0; // envoie régulier de 0 vers le dimmer dans certains cas 

/// constantes de debug 
#define modeserial 0
//int inversion = 0 ; 
int phi;
int somme, sigma ;
int signe = 0;
int temp = 0; 
int timer = 0 ; 
String retour; 
int nbtent=0;
int moyenne, laststartvalue; 
String message; 
String configweb , memory, inputMessage;
int inj_mode = 0 ; 
//int RMS = 0 ;
bool change;
//String serialmessage; 
bool middlevalue=0;
int bypassfalse=0;
//int resistance=1000;


int bestcosphi, bestpuissance; 
//***********************************
//************* Gestion du serveur WEB
//***********************************
// Create AsyncWebServer object on port 80
WiFiClient domotic_client;
// mqtt
PubSubClient client(domotic_client);

AsyncWebServer server(80);
DNSServer dns;
HTTPClient http;


// creation des fonctions de collect 

//***********************************
//************* retour des pages
//***********************************

String getState() {
  String state ; 
  if ( inj_mode == 0 ) {   state = "Linky"; }
  if ( inj_mode == 1 ) {   state = "Injection"; }
  if ( inj_mode == 2 ) {   state = "Stabilise"; }
  //int sigma = somme ;
  state = state + ";" + sigma + ";" + dimmer_power ;
  return String(state);
}

const char* PARAM_INPUT_1 = "send"; /// paramettre de retour sendmode
const char* PARAM_INPUT_2 = "cycle"; /// paramettre de retour cycle
const char* PARAM_INPUT_3 = "readtime"; /// paramettre de retour readtime
const char* PARAM_INPUT_4 = "cosphi"; /// paramettre de retour cosphi
const char* PARAM_INPUT_save = "save"; /// paramettre de retour cosphi
const char* PARAM_INPUT_dimmer = "dimmer"; /// paramettre de retour cosphi
//const char* PARAM_INPUT_server = "server"; /// paramettre de retour server domotique
const char* PARAM_INPUT_IDX = "idx"; /// paramettre de retour idx
const char* PARAM_INPUT_IDXdimmer = "idxdimmer"; /// paramettre de retour idx
//const char* PARAM_INPUT_port = "port"; /// paramettre de retour port server domotique
const char* PARAM_INPUT_delta = "delta"; /// paramettre retour delta
const char* PARAM_INPUT_deltaneg = "deltaneg"; /// paramettre retour deltaneg
const char* PARAM_INPUT_fuse = "fuse"; /// paramettre retour fusible numérique
const char* PARAM_INPUT_API = "apiKey"; /// paramettre de retour apiKey
const char* PARAM_INPUT_servermode = "servermode"; /// paramettre de retour activation de mode server
const char* PARAM_INPUT_dimmer_power = "POWER"; /// paramettre de retour activation de mode server
const char* PARAM_INPUT_facteur = "facteur"; /// paramettre retour delta
const char* PARAM_INPUT_tmax = "tmax"; /// paramettre retour delta
const char* PARAM_INPUT_mqttserver = "mqttserver"; /// paramettre retour mqttserver
const char* PARAM_INPUT_reset = "reset"; /// paramettre retour mqttserver
const char* PARAM_INPUT_publish = "publish"; /// paramettre retour mqttserver

String stringbool(bool mybool){
  String truefalse = "true";
  if (mybool == false ) {truefalse = "";}
  return String(truefalse);
  }

String getSendmode() {
  String sendmode;
  if ( config.sending == 0 ) {   sendmode = "Off"; }
  else {   sendmode = "On"; }
  return String(sendmode);
}



String getServermode(String Servermode) {
  //if ( Servermode == "Domoticz" ) {   config.UseDomoticz = !config.UseDomoticz; }
  //if ( Servermode == "Jeedom" ) {   config.UseJeedom = !config.UseJeedom;}
  //if ( Servermode == "Autonome" ) {   config.autonome = !config.autonome; }
  if ( Servermode == "Dimmer local" ) {   config.dimmerlocal = !config.dimmerlocal; }
  if ( Servermode == "MQTT" ) {   config.mqtt = !config.mqtt; }

