xlyric/pv-router-esp8266/src/main.cpp
return String(Servermode);
}

String getSigma() {
  
  return String(sigma);
}


String getcosphi() {
  
  return String(rawdata) ;
}


String getpuissance() {
  //int tempvalue=15;
  
  return String(bestpuissance*config.facteur) ;
}



String getconfig() {
  configweb ="";
  //configweb = String(config.hostname) + ";" +  config.port + ";"  + config.IDX + ";"  +  VERSION +";" + middle +";"+ config.delta +";"+config.cycle+";"+config.dimmer+";"+config.cosphi+";"+config.readtime +";"+stringbool(config.UseDomoticz)+";"+stringbool(config.UseJeedom)+";"+stringbool(config.autonome)+";"+config.apiKey+";"+stringbool(config.dimmerlocal)+";"+config.facteur+";"+stringbool(config.mqtt)+";"+config.mqttserver+";"+config.deltaneg+";"+config.resistance;
  configweb = VERSION + ";" + stringbool(config.mqtt) +  ";" + config.mqttserver + ";"  + String(config.Publish) + ";" + config.IDX + ";" +  String(config.IDXdimmer) + ";"  + config.num_fuse + ";"  + config.delta + ";" + config.deltaneg +";" +config.dimmer+";"+config.cosphi+";"+stringbool(config.autonome)+";"+config.facteur+";"+config.resistance;
  return String(configweb);
}

String getchart() {
	  oscilloscope() ;
      return String(retour);
}

String getdebug() {
  configweb ="";
  configweb = String(ESP.getFreeHeap())+ ";" + String(laststartvalue)  + ";" +  String(middle) + ";" +  phi +";"+ config.resistance ;
    return String(configweb);
}

String getmemory() {
  
    memory = String(ESP.getFreeHeap()) + ";" + String(ESP.getHeapFragmentation()) + ";" + String(ESP.getMaxFreeBlockSize());
      return String(memory);
}

String getlogs() {
    
      return String(logs);
}


String processor(const String& var){
   Serial.println(var);
   if (var == "SIGMA"){
    return getSigma();
  }
  else if (var == "SENDMODE"){
  
    return getSendmode();
  }
  else if (var == "STATE"){
    
    return getState();
  }  
return getState();
}


					//***********************************
					//************* Setup 
					//***********************************

void setup() {
// init port
  pinMode(linky, INPUT);
  
  Serial.begin(115200);
  Serial.println();

  // Initialising OLED
  display.init();
  display.flipScreenVertically();
  display.setFont(ArialMT_Plain_10);
  display.clear();

  //démarrage file system
  LittleFS.begin();
  Serial.println("Demarrage file System");

  // vérification de la présence d'index.html
  if(!LittleFS.exists("/index.html")){
    Serial.println("Attention fichiers LittleFS non chargé sur l'ESP, ça ne fonctionnera pas.");  
    logs += "Attention fichiers LittleFS non chargé sur l'ESP, ça ne fonctionnera pas.";
    }
  
		//***********************************
		//************* Setup -  récupération du fichier de configuration
		//***********************************
  
  // Should load default config if run for the first time
  Serial.println(F("Loading configuration..."));
   logs += "Loading configuration.../r/n";
  loadConfiguration(filename_conf, config);

  // Create configuration file
  Serial.println(F("Saving configuration..."));
  logs += "Saving configuration... /r/n";
  saveConfiguration(filename_conf, config);
  

  // configuration dimmer
  dimmer_hard.begin(NORMAL_MODE, ON); //dimmer initialisation: name.begin(MODE, STATE) 
  dimmer_hard.setPower(0); 
  USE_SERIAL.println("Dimmer started...");
   
   // configuration Wifi
  AsyncWiFiManager wifiManager(&server,&dns);
  wifiManager.autoConnect("pvrouter", "pvrouter");

  
		//***********************************
		//************* Setup - Connexion Wifi
		//***********************************
  
  // Wait for connection
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }

  //Si connexion affichage info dans console
  Serial.println("");
  Serial.print("Connection ok sur le reseau :  ");
 
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP()); 
  Serial.println(ESP.getResetReason());
  // mqtt
  if (config.mqtt==1) { client.connect("pvrouter"); }
		//***********************************
		//************* Setup - OTA 
		//***********************************
		
  ArduinoOTA.setHostname("PV Routeur");
  //ArduinoOTA.setPassword(otapassword);
  ArduinoOTA.onStart([]() {
    Serial.println("Start");
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed");
  });
  ArduinoOTA.begin();
  

		//***********************************
		//************* Setup - Web pages
		//***********************************

  server.on("/",HTTP_ANY, [](AsyncWebServerRequest *request){
      if(LittleFS.exists("/index.html")){
     request->send(LittleFS, "/index.html", String(), false, processor);
    }
    else {request->send_P(200, "text/plain", "fichiers LittleFS non présent sur l ESP. " ); }
  });

  server.on("/config.html",HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/config.html", String(), false, processor);
  });
  
  server.on("/all.min.css", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/all.min.css", "text/css");
  });

    server.on("/favicon.ico", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/favicon.ico", "image/png");
  });

  server.on("/fa-solid-900.woff2", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/fa-solid-900.woff2", "text/css");
  });
  
    server.on("/sb-admin-2.js", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/sb-admin-2.js", "text/javascript");
  });

  server.on("/sb-admin-2.min.css", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send(LittleFS, "/sb-admin-2.min.css", "text/css");
  });

  server.on("/chart.json", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send_P(200, "application/json", getchart().c_str());
  }); 
  
  server.on("/sendmode", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", getSendmode().c_str());
  });
  
  server.on("/state", HTTP_ANY, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", getState().c_str());
  });

