xlyric/pv-router-esp8266/src/main.cpp
    if ( modeserial == 1 )  {Serial.println("prod"); }
  
    message = "Mode Linky        "; 
    inj_mode=0;

    if ( config.sending == 1 ) {
       SendToDomotic(String(sigma));  
    
      
       delay(2*attente*1000); 
    }
  }
  
//**************************
// injection 
//**************************
  else if ( sigma < config.deltaneg ) {
    
    if ( modeserial == 1 )  {Serial.println("inj"); }
    
    message = "Correc injection    ";
    inj_mode=1;
    
    if ( config.sending == 1) {
            SendToDomotic(String(sigma));  
            
            delay(2*attente*1000); 
    
    } 
    
  }
  else {
		message = "Mode stabilise    " ;
		inj_mode=2;
    if ( config.sending == 1 ) {	 security ++; if ( security >=6 ) { SendToDomotic(String(sigma)); delay(5*attente*1000); security =0; }  }  // envoie de l'info de temps en temps pour les logs
  }
  affiche_info_injection(inj_mode);
  affiche_info_volume(sigma);
  if (config.autonome == 1 ) {dimmer(inj_mode); }

  }
  else 
  {
    bypassfalse++;
  }



//pause de X s secondes avant prochaine mesure

affiche_info_transmission(config.sending);
  delay (500*attente);
  ArduinoOTA.handle();

  dimmer_security_count ++; 
  if ( dimmer_security_count >= dimmer_security *120 )  {
      dimmer_security_count = 0; 
      /// dimmer security cut every %dimmer_security% minutes
        dimmer_hard.setPower(0);        
  }
  if ( config.dimmerlocal == 1 && change == 1   ) {  dimmer_hard.setPower(5) ; delay ( 250 ) ; dimmer_hard.setPower(dimmer_power) ; change = 0 ; }      
  delay (1000);                       
 }
 
// *************** FIN DE LOOP ********************


// ***********************************
// ************* Fonction interne
// ***********************************

// ***********************************
// ** recherche de changement sur la diode.
// ***********************************
void front(int variation) {
  int Watchdog=0 ;  int Watchdog_alert=0; 
	while ( digitalRead(sens) == variation ) {
	delayMicroseconds (25);
  Watchdog++;
  if ( Watchdog > 10000 && Watchdog_alert == 0 ) {  Serial.print("Attention pas de porteuse, alimentation 12v AC ou pont redresseur débranché ? "); Watchdog_alert =1 ; } 
	}
}



// ***********************************
// ************* Fonction  d'affichage
// ***********************************

// ***********************************
// ************* main 
// ***********************************

void affiche_info_main() {
  display.clear();
  
  display.drawXbm(0,0, 16, 16, antenne_logo);
  
  display.setTextAlignment(TEXT_ALIGN_CENTER);
  display.setFont(ArialMT_Plain_10);
  display.drawString(63, 0, String(WiFi.localIP().toString()));
  
  display.setTextAlignment(TEXT_ALIGN_LEFT);

  ////// affichage de l'état conf
  display.drawString(0,54, VERSION );
  affiche_info_transmission(config.sending);
  display.drawString(0,43, String(config.resistance)+" W" );
  display.display();
}

// ***********************************
// ************* affichage transmission
// ***********************************

void affiche_info_transmission (int transmission ){
  display.setColor(BLACK);
  display.fillRect(0, 16, 50, 10);
  
  display.setColor(WHITE);
  display.setTextAlignment(TEXT_ALIGN_LEFT);
  display.setFont(ArialMT_Plain_10);
	if ( transmission == 0 ) {   display.drawString(0,16, "Trans Off"); }
	else {   display.drawString(0,16, "Trans On "); }
  
  display.display();
}

// ***********************************
// ************* affichage du sigma et heure
// ***********************************

void affiche_info_volume(int volume ) {
  affiche_heure(); // Affichage de l'heure
  display.setColor(BLACK);
  display.fillRect(55, 30, 128, 64);
  
  display.setColor(WHITE);
  display.setTextAlignment(TEXT_ALIGN_CENTER);
  display.setFont(ArialMT_Plain_16);
  display.drawString(85,30, String(volume) + " W"); 
  display.drawString(85,47, String(dimmer_power) + " %"); 


  
  display.display();
}

// ***********************************
// ************* affichage mode de conso
// ***********************************

void affiche_info_injection(int injection_mode ) {
  display.setColor(BLACK);
  display.fillRect(75, 16, 128, 26);
  
  display.setColor(WHITE);
  display.setTextAlignment(TEXT_ALIGN_CENTER);
  display.setFont(ArialMT_Plain_10);
  display.drawString(100,16, "              ");
  
  if ( injection_mode == 0 ) {   display.drawString(100,16, "Linky"); }
  else if ( injection_mode == 1 ) {   display.drawString(100,16, "Injection"); }
  else {   display.drawString(100,16, "Stabilise"); }
  
  display.display();
}

// ***********************************
// ************* affichage des delta
// ***********************************

void affiche_info_delat() {

display.setColor(BLACK);
display.fillRect(0, 27, 55, 28);

display.setColor(WHITE);
display.setTextAlignment(TEXT_ALIGN_LEFT);
display.setFont(ArialMT_Plain_10);
display.drawString(0,29, "Delta : " + String(config.delta));
display.drawString(0,41, "Neg : " + String(config.deltaneg));

display.display();
}

// ***********************************
// ************* affichage Heure
// ***********************************
void affiche_heure()
{
String ActualTime = timeClient.getFormattedTime();
//String ActualTime = timeClient.getHours()+":"+timeClient.getMinutes() ;
display.setColor(BLACK);
display.fillRect(0, 27, 55, 28);

display.setColor(WHITE);
display.setTextAlignment(TEXT_ALIGN_LEFT);
display.setFont(ArialMT_Plain_10);
display.drawString(0,29, ActualTime);
//display.drawString(0,41, "Neg : " + String(config.deltaneg));

display.display();
}


// ***********************************
// ************* affichage logo transmission
// ***********************************
void affiche_transmission(int actif) {
 if ( actif == 1 ) { 
 display.drawXbm(111,0 , 16, 16, antenne_logo2); 
 }
 else {
  display.setColor(BLACK);
  display.fillRect(111, 0, 127, 16);
  display.setColor(WHITE); 
  }
  display.display();
}



//***********************************
//** Oscillo mode creation du tableau de mesure pour le graph
//***********************************

void oscilloscope() {

  timer = 0; 

