xlyric/pv-router-esp8266/src/main.cpp
  retour = "[[";
  front (0);
  front(1);
  delayMicroseconds (config.cosphi*config.readtime); // correction décalage
  while ( timer < ( freqmesure ) )
  {

  
  temp =  analogRead(linky); signe = digitalRead(sens);
  moyenne = middle - 25 + signe*50; 
  /// mode oscillo graph 

  
  retour += String(timer) + "," + String(moyenne) + "," + String(temp) + "],[" ; 
  timer ++ ;
  delayMicroseconds (config.readtime);
  } 
  
  temp =  analogRead(linky); signe = digitalRead(sens);
  moyenne = middle - 25 + signe*50; 
  retour += String(timer) + "," + String(moyenne) + "," + String(temp) + "]]" ;
 

  
}

//***********************************
//************* Fonction mesure de la résistance ( à la louche )
//***********************************

int mesure_resistance () {
 // mise à 0 dimmer 
  String baseurl; 
  baseurl = "/?POWER=" + String(0) ; 
  http.begin(domotic_client,config.dimmer,80,baseurl);   

  http.GET();   
  http.end(); 
  delay (5000); 
 
 int resistance; 
 int boucle=0;
 int temp=0;

 int min=1024; 
 int max=0; 
 int valup=0; int valdown=0;
 
 //lecture 0%   
  while (boucle < freqmesure){
  temp =  analogRead(linky);
  if ( temp > max )  { max = temp ; } 
  if ( temp < min )  { min = temp ; }
  delayMicroseconds (readtime); 
  boucle++;
  }
  valdown = max-min; 

  baseurl = "/?POWER=" + String(50) ; 
  http.begin(domotic_client,config.dimmer,80,baseurl);   

  http.GET();   
  http.end(); 
  delay (5000); 

  boucle=0; min=1024; max=0; 
  //lecture 50% 
  while (boucle < freqmesure){
  temp =  analogRead(linky);
  if ( temp > max )  { max = temp ; } 
  if ( temp < min )  { min = temp ; }
  delayMicroseconds (readtime); 
  boucle++;
  }
  valup = max-min; 

  resistance = ( valup - valdown )*2*5 ;

  // dimmer à 0
  baseurl = "/?POWER=" + String(0) ; 
  http.begin(domotic_client,config.dimmer,80,baseurl);   
  http.GET();   
  http.end();
  
  return (resistance);
}




//***********************************
//************* Fonction valeur moyenne et calcul 
//***********************************
void valeur_moyenne() {

  String log="";
  float moyenne = 0; 
  int temp = 0 ;
  int j = 0;
  int i = 0; 
  int up = 0; 
  middlevalue = 0;
  int sommetemp = 0;
  int sommeinverse = 0;  
  int sommetotale = 0; 
  int demicycle = freqmesure/2; 
  //int derive = 0 ; 

  int min=1024; 
  int max=0; 
  int startvalue=0; 
  unsigned long startMillis;

  
  //// attente du prochain cycle 

  while (digitalRead(sens) != 1 ) {
        delayMicroseconds (100);
  }
   
  while (digitalRead(sens) != 0 ) {
        delayMicroseconds (10);
  }

  startMillis = micros();

  ////  calcul de la 1/2 onde 
  //// rajout de la condition && j < (demicycle-20)  pour éviter les rebonds 
  while (digitalRead(sens) != 1 && j < (demicycle) ) {
    temp =  analogRead(linky);
  
    if ( ( j >= config.cosphi  && j < (demicycle+config.cosphi) )) {  
      sommetemp += temp;  i++; 
      log += String(temp) + "-" ; 
    }
    else  {
      log += String(temp) + " " ;
      sommeinverse += temp; 
    }
    if ( j == config.cosphi ) { startvalue = temp; }
    if ( temp > max )  { max =temp ; up = j; } 
    if ( temp < min )  { min = temp ; }
    j ++;  
    rt_loop( startMillis, readtime*j ) ; 
  }
  log += + "++" ;
  /// calcul de la 2em 1/2 onde 
  while (digitalRead(sens) != 0 && j != freqmesure ) {
    temp =  analogRead(linky);
    if ( j < (demicycle+config.cosphi) ) { 
      sommetemp += temp; i++;  
      log += String(temp) + "-" ;
    }
    else  {
      log += String(temp) + " " ;
      sommeinverse += temp; 
    }
    if ( temp > max )  { max =temp ; up = j;  } 
    if ( temp < min )  { min = temp ; }
    j ++; 
    rt_loop( startMillis, readtime*j ) ; 
  }
  // affichage du temps pris
  startMillis =  micros() - startMillis ;
  Serial.print("temp: ");
  Serial.print(startMillis);  


  sommetotale = ( sommetemp + sommeinverse )  ; 
  
  moyenne = float(sommetotale) / float(freqmesure) ;
  float moyenne2 =  ((float(min) + float(max)) / 2.0) ;
  float moyenne3 = config.cycle; 
  

  somme = (sommetemp - (moyenne*demicycle)) ; 
  float somme2 = (sommetemp - (moyenne2*demicycle)) ; 
  float somme3 = (sommetemp - (moyenne3*demicycle)) ; 

    
  float inverse1 =  (sommeinverse - (moyenne*demicycle)); 
  float inverse2 =  (sommeinverse - (moyenne2*demicycle)) ; 
  float inverse3 =  (sommeinverse - (moyenne3*demicycle)) ; 
  
  if ( j >=goodcycle || bypassfalse >= 5  ) {      
    Serial.println("-------------");
    Serial.print("valeur moyenne");
    Serial.println(moyenne);
    Serial.print("cycle : ");
    Serial.println(j);
    Serial.print("demi : ");
    Serial.println(i);
    
    Serial.print("cosphi :");
    Serial.println(config.cosphi);
    Serial.print("sommetemp :");
    Serial.println(sommetemp);
    
    Serial.print("somme :");
    Serial.println(somme);  
    Serial.print("min max :");
    Serial.print(min );
    Serial.print(" ");
    Serial.println(max);
    Serial.print("START :");
    Serial.println(startvalue );
    laststartvalue = startvalue ;
    Serial.println(log);
  
    middle = moyenne ;
    middlevalue = 1; 

    long rssi = WiFi.RSSI();
    Serial.print("RSSI:");
    Serial.println(rssi);
  }

  else { 
      Serial.println("erreur cycle :");
      Serial.println(j);
  }
  /// retrait de rowdata de la condition pour debug    
rawdata = log + "  \r\n -- phi : " + ( up - (j/4) ) +  " somme : " + sommetemp  + " -- somme inverse : " + sommeinverse + "\r\n -- middle : " + moyenne  +  "-- somme :" + somme +  "-- inv :" + inverse1 + "  \r\n -- moyenne 2 : " +  moyenne2 + " : " + somme2 + "-- inv :" + inverse2 + " total " + (somme2 - inverse2 )/2 + " \r\n -- moyenne 3 : " +  moyenne3 + " : " + somme3 + "-- inv :" + inverse3 + " total " + (somme3 - inverse3 )/2 +" temps" + startMillis;
}

//////////////////////// RT loop

void rt_loop (unsigned long startmicro, unsigned long timer )
{

  while ( micros() <=  ( startmicro + timer ) )
  {
    delayMicroseconds(1);
  }
}



//***********************************
//************* Fonction domotique 
//***********************************

boolean SendToDomotic(String Svalue){
  String baseurl; 
  Serial.print("connecting to mqtt & dimmer");
  //Serial.println(config.hostname);
    
  if ( config.mqtt == 1 ) {     mqtt(String(config.IDX),Svalue);  }
  Serial.println(baseurl);
  
