xlyric/pv-router-esp8266/src/main.cpp
  if ( config.autonome == 1 && change == 1   ) {  baseurl = "/?POWER=" + String(dimmer_power) ; http.begin(domotic_client,config.dimmer,80,baseurl);   
    http.GET();
    http.end(); 
    if ( config.mqtt == 1 ) { mqtt(String(config.IDXdimmer), String(dimmer_power));  }
    delay (3000); // delay de transmission réseau dimmer et application de la charge
  }
  valeur_moyenne();  
  return true; 
}


//***********************************
//************* Fonction aservissement autonome
//***********************************

void dimmer(int commande){
  change = 0; 

  // 0 -> linky ; 1-> injection  ; 2-> stabilisé

  
	if ( sigma >= 350 && dimmer_power != 0 ) { dimmer_power = 0 ;  change = 1 ;} // si grosse puissance instantanée sur le réseau, coupure du dimmer. ( ici 350w environ ) 
	else if (commande == 0 && dimmer_power != 0 && sigma >= (config.delta+10) ) { dimmer_power += -2*((sigma-config.delta)/(50*config.resistance/1000)) ; change = 1; }  /// si gros mode linky  on reduit la puissance par extrapolation
	else if (commande == 0 && dimmer_power != 0 ) { dimmer_power += -1 ; change = 1; }  /// si mode linky  on reduit la puissance 
  else if (commande == 1 && sigma <= (config.deltaneg-10) ) {   dimmer_power += 2*abs(sigma/(50*config.resistance/1000)) ; change = 1 ; } /// si grosse injection on augmente la puissance par extrapolation
  else if (commande == 1  ) { dimmer_power += 1 ; change = 1 ; } /// si injection legère on augmente la puissance doucement
  //else if (commande == 1  ) { dimmer_power += round(sigma/(bestpuissance * config.facteur)*100)  ; change = 1 ; } /// si injection on augmente la puissance
  
/// test puissance de sécurité 
  if ( dimmer_power >= config.num_fuse ) {dimmer_power = config.num_fuse; change = 1 ; }
  if ( dimmer_power <= 0 && dimmer_power != 0 ) {dimmer_power = 0; change = 1 ; }

  if (commande == 2  ) { change = 1 ; } /// mode stabilisé, envoie de sigma de temps en temps

  security ++ ;
  if ( security >= 5 ) { if ( dimmer_power <= 0 ) {dimmer_power = 0; change = 1 ; security = 0;  }} 


}


void mqtt(String idx, String value)
{
  String nvalue = "0" ; 
  if ( value != "0" ) { nvalue = "2" ; }
  String message = "  { \"idx\" : " + idx +" ,   \"svalue\" : \"" + value + "\",  \"nvalue\" : " + nvalue + "  } ";

  if (!client.connected()) {
    reconnect();
  }
  client.loop();
  client.publish(config.Publish, String(message).c_str(), true);
}




void reconnect() {
  // Loop until we're reconnected
  while (!client.connected()) {
    Serial.print("Attempting MQTT connection...");
    // Create a random client ID
    String clientId = "ESP8266Client-";
    clientId += String(random(0xffff), HEX);
    // Attempt to connect
    if (client.connect(clientId.c_str())) {
      Serial.println("connected");
      // Once connected, publish an announcement...
      client.publish("outTopic", "hello world it's me !! PvRouter ");
      // ... and resubscribe
      client.subscribe("inTopic");
    } else {
      Serial.print("failed, rc=");
      Serial.print(client.state());
      Serial.println(" try again in 5 seconds");
      // Wait 5 seconds before retrying
      delay(5000);
    }
  }
}

